<?php
/**
* Îןנוהוכוםטו ךמהטנמגךט המךףלוםעא
* @package Pilot
* @subpackage CMS
* @version 3.0
* @author Rudenko Ilya <rudenko@delta-x.com.ua>
* @copyright Copyright 2004, Delta-X ltd.
*/

/**
 * Êכאסס מבנאבמעךט ךמהטנמגמך המךףלוםעא
 * @package Pilot
 * @subpackage CMS
 * @author Rudenko Ilya <rudenko@delta-x.com.ua>
 */
class Charset {
		
	
	/**
	 * Òאבכטצא ךמםגונעאצטט נףססךטץ בףךג ג ‎ךגטגאכוםעםûו אםדכטיסךטו
	 * @var array
	 */
	static public $rus2lat = array(
		'Ó' => 'Y', 'Ê' => 'K', 'Å' => 'E', 'Í' => 'H', 'Õ' => 'X', 'Â' => 'B', 
		'À' => 'A', 'Ð' => 'P', 'Î' => 'O', 'Ñ' => 'C', 'Ì' => 'M', 'Ò' => 'T'
	);
	
	/**
	* Òאבכטצא ןונוךמהטנמגךט עוךסעא ג ענאםסכטע
	* @var array
	*/
	static public $translit = array(
		'א' => 'a', 'ב' => 'b', 'ג' => 'v', 'ד' => 'g', 'ה' => 'd', 'ו' => 'e', '¸' => 'e', 'ז' => 'zh', 'ח' => 'z', 'ט' => 'i',
		'י' => 'j', 'ך' => 'k', 'כ' => 'l', 'ל' => 'm', 'ם' => 'n', 'מ' => 'o', 'ן' => 'p', 'נ' => 'r', 'ס' => 's', 'ע' => 't',
		'ף' => 'u', 'פ' => 'f', 'ץ' => 'h', 'צ' => 'ts', 'ק' => 'ch', 'ר' => 'sh', 'ש' => 'shch', 'ü' => '\'', 'ת' => '', 'û' => 'i',
		'‎' => 'e', '‏' => 'yu', 'ÿ' => 'ya', '÷' => 'ye', '¿' => 'yi', '³' => 'i',
		
		'À' => 'A', 'Á' => 'B', 'Â' => 'V', 'Ã' => 'G', 'Ä' => 'D', 'Å' => 'E', '¨' => 'E', 'Æ' => 'Zh', 'Ç' => 'Z',
		'È' => 'I', 'É' => 'J', 'Ê' => 'K', 'Ë' => 'L', 'Ì' => 'M', 'Í' => 'N', 'Î' => 'O', 'Ï' => 'P', 'Ð' => 'R',
		'Ñ' => 'S', 'Ò' => 'T', 'Ó' => 'U', 'Ô' => 'F', 'Õ' => 'H', 'Ö' => 'Ts', '×' => 'Ch', 'Ø' => 'Sh', 'Ù' => 'Shch',
		'Ú' => '\'', 'Ü' => '', 'Û' => 'I', 'Ý' => 'E', 'Þ' => 'u', '‗' => 'Ya', '×' => 'Ye', '¯' => 'Yi',  '²' => 'I'
	);
	
	static function rus2lat($val) {
		return strtr($val, Charset::$rus2lat);
	}

	static public function translit($val) {
		return strtr($val, Charset::$translit);
	}
	
	
		/**
	 * Addon, translit functions 
	 * @author Barin Mikhail <barin@delta-x.ua>
	 * 
	 * Start
	 * 
	 */	

	/**
	* Òנאםסכטעונאצטמםםאÿ עאבכטצא ףךנאטםסךמי ט נףססךמי כאעטםטצû (ÓË ט ÐË) םא 1998-2000 דד.
	* @var array
	*/
	static public $tab_ul = array( 
		'ua' => array(
			'א' => 'a', 'ב' => 'b', 'ג' => 'v', 'ד' => 'gh', '´' => 'g',  'ה' => 'd', 'ו' => 'e', '÷' => 'je', 'ז' => 'zh', 'ח' => 'z', 
			'ט' => 'y', '³' => 'i', '¿' => 'ji', 'י' => 'j', 'ך' => 'k', 'כ' => 'l', 'ל' => 'm', 'ם' => 'n', 'מ' => 'o', 'ן' => 'p', 
			'נ' => 'r', 'ס' => 's', 'ע' => 't', 'ף' => 'u', 'פ' => 'f', 'ץ' => 'kh', 'צ' => 'c', 'ק' => 'ch', 'ר' => 'sh', 'ש' => 'shh', 
			'‏' => 'ju', 'ÿ' => 'ja', 'ü' => 'j', '¸' => 'jo', 'ת' => '\'', 'û' => 'y', '‎' => 'e',
			
			'À' => 'A', 'Á' => 'B', 'Â' => 'V', 'Ã' => 'Gh', '¥' => 'G', 'Ä' => 'D', 'Å' => 'E', '×' => 'Je', 'Æ' => 'Zh', 'Ç' => 'Z', 
			'È' => 'Y', '²' => 'I', '¯' => 'Ji', 'É' => 'J', 'Ê' => 'K', 'Ë' => 'L', 'Ì' => 'M', 'Í' => 'N', 'Î' => 'O', 'Ï' => 'P', 
			'Ð' => 'R', 'Ñ' => 'S', 'Ò' => 'T', 'Ó' => 'U', 'Ô' => 'F', 'Õ' => 'Kh', 'Ö' => 'C', '×' => 'Ch', 'Ø' => 'Sh', 'Ù' => 'Shh', 
			'Þ' => 'Ju', '‗' => 'Ja', 'Ü' => 'J', '¨' => 'Jo', 'Ú' => '\'', 'Û' => 'Y', 'Ý' => 'E'),
		'ru' => array(
			'א' => 'a', 'ב' => 'b', 'ג' => 'v', 'ד' => 'g', '´' => 'g',  'ה' => 'd', 'ו' => 'je', '÷' => 'je', 'ז' => 'zh', 'ח' => 'z', 
			'ט' => 'i', '³' => 'i', '¿' => 'ji', 'י' => 'j', 'ך' => 'k', 'כ' => 'l', 'ל' => 'm', 'ם' => 'n', 'מ' => 'o', 'ן' => 'p', 
			'נ' => 'r', 'ס' => 's', 'ע' => 't', 'ף' => 'u', 'פ' => 'f', 'ץ' => 'kh', 'צ' => 'c', 'ק' => 'ch', 'ר' => 'sh', 'ש' => 'shh', 
			'‏' => 'ju', 'ÿ' => 'ja', 'ü' => 'j', '¸' => 'jo', 'ת' => '\'', 'û' => 'y', '‎' => 'e',
			
			'À' => 'A', 'Á' => 'B', 'Â' => 'V', 'Ã' => 'G', '¥' => 'G', 'Ä' => 'D', 'Å' => 'Je', '×' => 'Je', 'Æ' => 'Zh', 'Ç' => 'Z', 
			'È' => 'I', '²' => 'I', '¯' => 'Ji', 'É' => 'J', 'Ê' => 'K', 'Ë' => 'L', 'Ì' => 'M', 'Í' => 'N', 'Î' => 'O', 'Ï' => 'P', 
			'Ð' => 'R', 'Ñ' => 'S', 'Ò' => 'T', 'Ó' => 'U', 'Ô' => 'F', 'Õ' => 'Kh', 'Ö' => 'C', '×' => 'Ch', 'Ø' => 'Sh', 'Ù' => 'Shh', 
			'Þ' => 'Ju', '‗' => 'Ja', 'Ü' => 'J', '¨' => 'Jo', 'Ú' => '\'', 'Û' => 'Y', 'Ý' => 'E')
	);
	
	/**
	* Òנאםסכטעונאצטמםםאÿ עאבכטצא ךטנטככטצû (נףס-ףךנ),  ÃÎÑÒ-16876-71 (Ñע. ÑÝÂ 1362-78) ס Èחלוםוםטול N 2, םא לאנע 1980 ד.. Ïמסע. N 1267 מע 21.03.80 (ÈÓÑ 5-80).
	* @var array
	*/
	static public $tab_ussr_gost = array(
		'א' => 'a', 'ב' => 'b', 'ג' => 'v', 'ד' => 'g', '´' => 'g',  'ה' => 'd', 'ו' => 'e', '÷' => 'je', '¸' => 'jo', 'ז' => 'zh', 
		'ח' => 'z', 'ט' => 'i', '³' => 'i', '¿' => 'ji', 'י' => 'j', 'ך' => 'k', 'כ' => 'l', 'ל' => 'm', 'ם' => 'n', 'מ' => 'o', 
		'ן' => 'p', 'נ' => 'r', 'ס' => 's', 'ע' => 't', 'ף' => 'u', 'פ' => 'f', 'ץ' => 'kh', 'צ' => 'c', 'ק' => 'ch', 'ר' => 'sh', 
		'ש' => 'shh', 'ת' => '"', 'û' => 'y', '‎' => 'eh', '‏' => 'ju', 'ÿ' => 'ja', 'ü' => '\'', 
		
		'À' => 'A', 'Á' => 'B', 'Â' => 'V', 'Ã' => 'G', '¥' => 'G',  'Ä' => 'D', 'Å' => 'E', '×' => 'Je', '¨' => 'Jo', 'Æ' => 'Zh', 
		'Ç' => 'Z', 'È' => 'I', '²' => 'I', '¯' => 'Ji', 'É' => 'J', 'Ê' => 'K', 'Ë' => 'L', 'Ì' => 'M', 'Í' => 'N', 'Î' => 'O', 
		'Ï' => 'P', 'Ð' => 'R', 'Ñ' => 'S', 'Ò' => 'T', 'Ó' => 'U', 'Ô' => 'F', 'Õ' => 'Kh', 'Ö' => 'C', '×' => 'Ch', 'Ø' => 'Sh', 
		'Ù' => 'Shh', 'Ú' => '"', 'Û' => 'Y', 'Ý' => 'Eh', 'Þ' => 'Ju', '‗' => 'Ja', 'Ü' => '\''
	);	
	
	/**
	* Äמןמכםטעוכüםאÿ עאבכטצא ענאםסכטעונאצטט
	* @var array
	*/
	static public $tab_wide = array(
		'ך' => 'c', '‏' => 'u', 'ךס' => 'x',
		'Ê' => 'C', 'Þ' => 'U', 'Êס' => 'X',
	);	
	
	/**
	* Íמנלאעטגםאÿ עאבכטצא הכÿ גמססמחהאםטÿ ףךנאטםסךטץ סמבסעגוםםûץ טלום סנוהסעגאלט אםדכטיסךמדמ ÿחûךא. Èח Ïנמעמךמכא N2 מע 19 אןנוכÿ 1996 ד.
	* @var array
	*/
	static public $tab_protocol = array(
		'ua' => array(
			'א' => 'a', 'ב' => 'b', 'ג' => 'v', 'ד' => 'gh', '´' => 'g',  'ה' => 'd', 'ו' => 'e', '÷' => 'ie', '¸' => 'io', 'ז' => 'zh', 
			'ח' => 'z', 'ט' => 'y', '³' => 'i', '¿' => 'i', 'י' => 'i', 'ך' => 'k', 'כ' => 'l', 'ל' => 'm', 'ם' => 'n', 'מ' => 'o', 
			'ן' => 'p', 'נ' => 'r', 'ס' => 's', 'ע' => 't', 'ף' => 'u', 'פ' => 'f', 'ץ' => 'kh', 'צ' => 'ts', 'ק' => 'ch', 'ר' => 'sh', 
			'ש' => 'sch', 'ת' => '\'', 'û' => 'y', '‎' => 'e', '‏' => 'iu', 'ÿ' => 'ia', 'ü' => '\'', 
			
			'À' => 'A', 'Á' => 'B', 'Â' => 'V', 'Ã' => 'H', '¥' => 'G',  'Ä' => 'D', 'Å' => 'E', '×' => 'Ye', '¨' => 'Yo', 'Æ' => 'Zh', 
			'Ç' => 'Z', 'È' => 'Y', '²' => 'I', '¯' => 'Yi', 'É' => 'Y', 'Ê' => 'K', 'Ë' => 'L', 'Ì' => 'M', 'Í' => 'N', 'Î' => 'O', 
			'Ï' => 'P', 'Ð' => 'R', 'Ñ' => 'S', 'Ò' => 'T', 'Ó' => 'U', 'Ô' => 'F', 'Õ' => 'Kh', 'Ö' => 'C', '×' => 'Ch', 'Ø' => 'Sh', 
			'Ù' => 'Sch', 'Ú' => '\'', 'Û' => 'Y', 'Ý' => 'E', 'Þ' => 'Yu', '‗' => 'Ya', 'Ü' => '\''),
		'ru' => array(
			'א' => 'a', 'ב' => 'b', 'ג' => 'v', 'ד' => 'g', '´' => 'g',  'ה' => 'd', 'ו' => 'ie', '÷' => 'ie', '¸' => 'io', 'ז' => 'zh', 
			'ח' => 'z', 'ט' => 'i', '³' => 'i', '¿' => 'i', 'י' => 'i', 'ך' => 'k', 'כ' => 'l', 'ל' => 'm', 'ם' => 'n', 'מ' => 'o', 
			'ן' => 'p', 'נ' => 'r', 'ס' => 's', 'ע' => 't', 'ף' => 'u', 'פ' => 'f', 'ץ' => 'kh', 'צ' => 'ts', 'ק' => 'ch', 'ר' => 'sh', 
			'ש' => 'sch', 'ת' => '\'', 'û' => 'y', '‎' => 'e', '‏' => 'iu', 'ÿ' => 'ia', 'ü' => '\'', 
			
			'À' => 'A', 'Á' => 'B', 'Â' => 'V', 'Ã' => 'H', '¥' => 'G',  'Ä' => 'D', 'Å' => 'Ye', '×' => 'Ye', '¨' => 'Yo', 'Æ' => 'Zh', 
			'Ç' => 'Z', 'È' => 'I', '²' => 'I', '¯' => 'Yi', 'É' => 'Y', 'Ê' => 'K', 'Ë' => 'L', 'Ì' => 'M', 'Í' => 'N', 'Î' => 'O', 
			'Ï' => 'P', 'Ð' => 'R', 'Ñ' => 'S', 'Ò' => 'T', 'Ó' => 'U', 'Ô' => 'F', 'Õ' => 'Kh', 'Ö' => 'C', '×' => 'Ch', 'Ø' => 'Sh', 
			'Ù' => 'Sch', 'Ú' => '\'', 'Û' => 'Y', 'Ý' => 'E', 'Þ' => 'Yu', '‗' => 'Ya', 'Ü' => '\'')
	);	
	
	
	/**
	* Òנאםסכטעונאצטמםםאÿ עאבכטצא גסוץ גמחלמזםûץ חםאקוםטי הכÿ ךטנטככטקוסךטץ סטלגמכמג
	* @var array
	*/
	static public $tab_translit = array(
			'א' => array('a'), 'ב' => array('b'), 'ג' => array('v'), 'ד' => array('gh','g','h'), '´' => array('g'),  'ה' => array('d'), 'ו' => array('e','je','ie','ye'), 
			'÷' => array('e','je','ie','ye'), '¸' => array('io','o','jo','yo'), 'ז' => array('zh'), 'ח' => array('z'), 'ט' => array('y','i'), '³' => array('i','y'), 
			'¿' => array('i','ji','yi'), 'י' => array('i','y','j'), 'ך' => array('k'), 'כ' => array('l'), 'ל' => array('m'), 'ם' => array('n'), 'מ' => array('o'), 
			'ן' => array('p'), 'נ' => array('r'), 'ס' => array('s'), 'ע' => array('t'), 'ף' => array('u'), 'פ' => array('f'), 'ץ' => array('kh','h'), 'צ' => array('ts','c'), 
			'ק' => array('ch'), 'ר' => array('sh'), 'ש' => array('sch','shh'), 'ת' => array('\'',''), 'û' => array('y','i'), '‎' => array('e','eh'), '‏' => array('iu','u','ju','yu'), 
			'ÿ' => array('ia','a','ja','ya'), 'ü' => array('\'',''), 
			
			'À' => array('A'), 'Á' => array('B'), 'Â' => array('V'), 'Ã' => array('Gh','G','H'), '¥' => array('G'),  'Ä' => array('D'), 'Å' => array('E','Je','Ie','Ye'), 
			'×' => array('E','Je','Ie','Ye'), '¨' => array('Io','O','Jo','Yo'), 'Æ' => array('Zh'), 'Ç' => array('Z'), 'È' => array('Y','I'), '²' => array('I','Y'), 
			'¯' => array('I','Ji','Yi'), 'É' => array('I','Y','J'), 'Ê' => array('K'), 'Ë' => array('L'), 'Ì' => array('M'), 'Í' => array('N'), 'Î' => array('O'), 
			'Ï' => array('P'), 'Ð' => array('R'), 'Ñ' => array('S'), 'Ò' => array('T'), 'Ó' => array('U','Y'), 'Ô' => array('F'), 'Õ' => array('Kh','H'), 'Ö' => array('Ts','C','Z'), 
			'×' => array('Ch'), 'Ø' => array('Sh'), 'Ù' => array('Sch','Shh'), 'Ú' => array('\'',''), 'Û' => array('Y','I'), 'Ý' => array('E','Eh'), 'Þ' => array('Iu','U','Ju','Yu'),
			'‗' => array('Ia','A','Ja','Ya'), 'Ü' => array('\'','')
	);	
	
	/**
	* Òנאםסכטעונטנףוע ףךנאטםסךטי עוךסע ג סממעגועסעגטט ס עאבכטצוי $tab_ul
	* @param string $val		
	* @param string $lang
	* @param bool $wide 		<- ןנט true ג המןמכםוםטו ך מסםמגםמי עאבכטצו םאךכאהûגאוע ענאםסכטעונאצטמםםף‏ עאבכטצף $tab_wide
	* @return string
	*/
	static public function getTranslitByUL($val, $lang='ru', $wide=false) {
		if(!$wide){ 
			return strtr($val, Charset::$tab_ul[$lang]); 
		}
		return strtr(strtr($val, Charset::$tab_wide), Charset::$tab_ul[$lang]);
	}
	
	/**
	* Òנאםסכטעונטנףוע ךטנטככטקוסךטי עוךסע ג סממעגועסעגטט ס עאבכטצוי $tab_ussr_gost
	* @param string $val	
	* @param string $lang
	* @param bool $wide 		<- ןנט true ג המןמכםוםטו ך מסםמגםמי עאבכטצו םאךכאהûגאוע ענאםסכטעונאצטמםםף‏ עאבכטצף $tab_wide
	* @return string
	*/
	static public function getTranslitByUSSRGOST($val, $wide=false) {
		if(!$wide){ 
			return strtr($val, Charset::$tab_ussr_gost); 
		}
		return strtr(strtr($val, Charset::$tab_wide), Charset::$tab_ussr_gost);
	}
	
	/**
	* Òנאםסכטעונטנףוע ףךנאטםסךטי עוךסע ג סממעגועסעגטט ס עאבכטצוי $tab_protocol
	* @param string $val	
	* @param string $lang
	* @param bool $wide 		<- ןנט true ג המןמכםוםטו ך מסםמגםמי עאבכטצו םאךכאהûגאוע ענאםסכטעונאצטמםםף‏ עאבכטצף $tab_wide
	* @return string
	*/
	static public function getTranslitByUAProtocol($val, $lang='ru', $wide=false) {
		if(!$wide){ 
			return strtr($val, Charset::$tab_protocol[$lang]); 
		}
		return strtr(strtr($val, Charset::$tab_wide), Charset::$tab_protocol[$lang]);
	}
	
	/**
	* Òנאםסכטעונטנףוע ףךנאטםסךטי עוךסע ג סממעגועסעגטט ס עאבכטצוי $tabUAProtocol ט םמנלאכטחטנףוע הכÿ ףןנמשוםםמדמ גאנטאםעא חאןטסט
	* @param string $val
	* @param string $lang
	* @param bool $wide 		<- ןנט true ג המןמכםוםטו ך מסםמגםמי עאבכטצו םאךכאהûגאוע ענאםסכטעונאצטמםםף‏ עאבכטצף $tab_wide
	* @return string
	*/
	static public function getTranslitByUAProtocolSoft($val, $lang='ru', $wide=false) {
		$firstRule = array('üמ' => '\'o', 'ü¿' => '\'i', 'ü' => '', '\'' => '', 'ת' => '');
		$seconrRule = array('zhzh' => 'zh', 'khkh' => 'kh', 'tsts' => 'th', 'chch' => 'ch', 'shsh' => 'sh');
		
		if(!$wide){ 
			return strtr(strtr(strtr($val, $firstRule), Charset::$tab_protocol[$lang]), $seconrRule); 
		}
		return strtr(strtr(strtr(strtr($val, Charset::$tab_wide), $firstRule), Charset::$tab_protocol[$lang]), $seconrRule); 
		
	}
	
	/**
	* Âמחגנאשאוע גסו גמחלמזםûו ענאםסכטעונאצטט עוךסעא, קעמ סממעגועסעגף‏ע דמסףהאנסעגוםםûל סעאםהאנעאל
	* @param string $val	
	* @return array
	*/
	static public function getTranslitStandart($val) {
		$res_mass = array();
			array_push($res_mass, Charset::getTranslitByUL($val));
			array_push($res_mass, Charset::getTranslitByUL($val,'ru',true));
			array_push($res_mass, Charset::getTranslitByUSSRGOST($val));
			array_push($res_mass, Charset::getTranslitByUSSRGOST($val,true));
			array_push($res_mass, Charset::getTranslitByUAProtocol($val));
			array_push($res_mass, Charset::getTranslitByUAProtocol($val,'ru',true));
			array_push($res_mass, Charset::getTranslitByUAProtocolSoft($val));
			array_push($res_mass, Charset::getTranslitByUAProtocolSoft($val,'ru',true));
		
			array_push($res_mass, Charset::getTranslitByUL($val,'ua'));
			array_push($res_mass, Charset::getTranslitByUL($val,'ua',true));
			array_push($res_mass, Charset::getTranslitByUAProtocol($val,'ua'));
			array_push($res_mass, Charset::getTranslitByUAProtocol($val,'ua',true));
			array_push($res_mass, Charset::getTranslitByUAProtocolSoft($val,'ua'));
			array_push($res_mass, Charset::getTranslitByUAProtocolSoft($val,'ua',true));
		
		return array_values(array_unique($res_mass)); 
	}
	
	/**
	* Âמחגנאשאוע לאססטג גסוץ גמחלמזםûץ גאנטאםעמג ענאםסכטעונאצטי סכמגא, מסםמגאםםûץ םא עאב. $tab_translit
	* @param string $word		
	* @return array
	*/
	static public function getTranslitAll($word) {
		$mass = array();
		$arr = str_split($word);
		Charset::findTranslitVariants($arr, sizeof($arr)-1, 0, $mass);
		return $mass;
	}
		
	/**
	* Âסןמלמדאעוכüםאÿ פףםךצטÿ. Ðוךףנסטגםמ ןונובטנאוע גסו גמחלמזםûו ענאםסכטעונאצטט עוךסעא ט חאםמסטע טץ ג לאססטג $mass
	* @param string $val	
	* @param int $lenght	
	* @param int $current_ch	
	* @param array $mass
	*/
	static private function findTranslitVariants($val, $lenght, $current_ch=0, &$mass=array()) {
		$variants = Charset::$tab_translit[$val[$current_ch]];
		$next_ch = $current_ch + 1;
		for($j=0;$j<sizeof($variants);$j++){
			$val[$current_ch] = $variants[$j];
			if($current_ch < $lenght) Charset::findTranslitVariants($val, $lenght, $next_ch, $mass);
			else array_push($mass, implode($val));
		}	
	}
		
	/**
	* Ïנמגונÿוע עוךסע םא םאכטקטו ףךנאטםסךטץ סטלגמכמג
	* @param string $val	
	* @return bool
	*/
	static public function isUAChars($val) {
		$ua_chars = array('¿' => '', '÷' => '', '¯' => '', '×' => ''); 
		$res = strtr($val,$ua_chars);
		
		if(strcmp($val, $res)){
			return true;
		}
		
		return false;
	}
		
	/**
	* Ïנמגונÿוע עוךסע םא םאכטקטו נףססךטץ סטלגמכמג
	* @param string $val	
	* @return bool
	*/
	static public function isRUChars($val) {
		$ru_chars = array('ת' => '', 'û' => '', '‎' => '', 'Ú' => '', 'Û' => '', 'Ý' => ''); 
		$res = strtr($val, $ru_chars);
		
		if(strcmp($val, $res)){
			return true;
		}
		
		return false;
	}
	
	/**
	 * End
	 */		
	
	

	/**
	* Àגעמלאעטקוסךמו מןנוהוכוםטו ךמהטנמגךט, ג סכףקאו, וסכט מםא םו גמחגנאשאועסÿ סונגונמל
	* @version 5.0.1 ףסמגונרוםסעגמגאםמ מןנוהוכוםטו ךמהטנמגךט הכÿ אםדכטיסךמדמ עוךסעא חא סקוע סממעםמרוםטÿ
	* ךמכטקוסעגא נףססךטץ בףךג ט כאעטםסךטץ. (ןמעמלף קעמ ןנט םאץמהוםטט סטלגמכמג " טח גמנהא טץ ןנוגנאשאכמ ג 
	* נףססךטו בףךגû Ô)
	* @param string $text
	* @return mixed
	*/
	static function detectCyrCharset($text) {
	    if (strlen($text) == 0) return false; // Åסכט ףבנאעü עמ ג ךמםצו בףהוע הוכוםטו םא םמכü
	    
		if (extension_loaded('mbstring')) {
			return mb_detect_encoding($text, CMS_DETECTION_ORDER);
		}

		// Âוס םטזםודמ ט גונץםודמ נודטסענמג
		$lowercase = 3;
		$uppercase = 1;
		
	    $charsets = Array ( 
						'KOI8-R' => 0, 
						'CP1251' => 0, 
						'CP866' => 0, 
						'ISO-8859-1' => 0, 
						'MacCyrillic' => 0 
					); 
	    for ( $i = 0, $length = strlen($text); $i < $length; $i++ ) { 
	        $char = ord($text[$i]);
	        
	        //non-russian characters 
	        if ($char < 128 || $char > 256) continue; 
	         
	        //CP866 
	        if (($char > 159 && $char < 176) || ($char > 223 && $char < 242)) $charsets['CP866']+=$lowercase; 
	        if (($char > 127 && $char < 160)) $charsets['CP866']+=$uppercase; 
	         
	        //KOI8-R 
	        if (($char > 191 && $char < 223)) $charsets['KOI8-R']+=$lowercase; 
	        if (($char > 222 && $char < 256)) $charsets['KOI8-R']+=$uppercase; 
	         
	        //WIN-1251 
	        if ($char > 223 && $char < 256) $charsets['CP1251']+=$lowercase; 
	        if ($char > 191 && $char < 224) $charsets['CP1251']+=$uppercase; 
	         
	        //MAC 
	        if ($char > 221 && $char < 255) $charsets['MacCyrillic']+=$lowercase; 
	        if ($char > 127 && $char < 160) $charsets['MacCyrillic']+=$uppercase; 
	         
	        //ISO-8859-5 
	        if ($char > 207 && $char < 240) $charsets['ISO-8859-1']+=$lowercase; 
	        if ($char > 175 && $char < 208) $charsets['ISO-8859-1']+=$uppercase; 
	         
	    }
	    
	    // UTF-8
	    $russian_utf8 = 'Å|É|Ö|Ó|Ê|Å|Í|Ã|Ø|Ù|Ç|Õ|Ú|Ô|Û|Â|À|Ï|Ð|Î|Ë|Ä|Æ|Ý|‗|×|Ñ|Ì|È|Ò|Ü|Á|Þ|¸|י|צ|ף|ך|ו|ם|ד|ר|ש|ח|ץ|ת|פ|û|ג|א|ן|נ|מ|כ|ה|ז|‎|ÿ|ק|ס|ל|ט|ע|ü|ב|‏';
		$russian_utf8 = @iconv('Windows-1251', 'UTF-8//IGNORE', $russian_utf8);
		$charsets['UTF-8'] = preg_match_all('/'.$russian_utf8.'/', $text, $matches) * 5;
		
	    arsort($charsets); 
	    $result = key($charsets);
	    
	    if (100 * $charsets[$result] / strlen($text) < 10) {
	    	// Íאהוםםûו סטלגמכû סמסעאגכÿ‏ע לוםוו 10% עוךסעא, חםאקטע ‎עמ אםדכטיסךטי עוסע ס Word'a (ס פטדףנםûלט ךאגûקךאלט)
	    	return false;
	    } else {
	    	return $result;
	    }
	} 

	/**
	* Ìוםÿוע ךמהטנמגךף סענאםטצû
	* @param string $source_charset
	* @param string $destination_charset
	* @param string $text
	* @return void
	*/
	static function convertCharSet($source_charset, $destination_charset, $text) {
		/**
		* Ïונוךמהטנףול עוךסע, וסכט םומבץמהטלמ
		*/
		if (!Charset::compareCharSets($destination_charset, $source_charset)) {
			// Ïאנאלוענ IGNORE - ףהאכÿוע סטלגמכû, ךמעמנûו מם םו למזוע חאלוםטעü,
			// םמ WARNING גסו נאגםמ גמחםטךאוע, ןמ‎עמלף לû ודמ דאסטל
			// Íאןנטלונ ¹ ג אםדכטיסךמל עוךסעו גûחûגאוע WARNING
			$text = @iconv($source_charset, $destination_charset.'//IGNORE', $text);
		}
		return $text;
	}
	
	/**
	* Ñגונÿוע סץמזוסעü ךמהטנמגמך, ס ףקועמל טץ אכüעונםאעטגםûץ טלום
	* @param string $charset1
	* @param string $charset2
	* @return bool
	*/
	static function compareCharSets($charset1, $charset2) {

		$charset1 = strtolower($charset1);
		$charset2 = strtolower($charset2);
		
		if ($charset1 == $charset2) {
			return true;
		}
		
		/**
		* Àכüעונםאעטגםûו טלוםא ךמהטנמגמך
		* @var array
		*/
		$charset_alias = array(
			'iso-8859-5' => 'iso-8859-5',
			'iso_8859-5:1988' => 'iso-8859-5',
			'iso-ir-144' => 'iso-8859-5',
			'iso_8859-5' => 'iso-8859-5',
			'cyrillic' => 'iso-8859-5',
			'iso8859-5' => 'iso-8859-5',
			'iso-8859.5' => 'iso-8859-5',
			'iso8859.5' => 'iso-8859-5',
			'iso' => 'iso-8859-5',
			
			'ibm866' => 'ibm866',
			'csibm866' => 'ibm866',
			'866' => 'ibm866',
			'cp866' => 'ibm866',
			'x-cp866' => 'ibm866',
			'x-ibm866' => 'ibm866',
			'cp-866' => 'ibm866',
			'alt' => 'ibm866',
			'dos' => 'ibm866',
			
			'windows-1251' => 'windows-1251',
			'win' => 'windows-1251',
			'x-cp1251' => 'windows-1251',
			'cp1251' => 'windows-1251',
			'cp-1251' => 'windows-1251',
			
			'koi8-r' => 'koi8-r',
			'koi-8-r' => 'koi8-r',
			'koi8' => 'koi8-r',
			'koi-8' => 'koi8-r',
			'koi' => 'koi8-r'
		);

		if (
			isset($charset_alias[$charset1])
			&& isset($charset_alias[$charset2])
			&& $charset_alias[$charset2] == $charset_alias[$charset2]
		) {
			return true;
		} else {
			return false;
		}
	}
	
	/**
	 * ------------------------------------------------------------------------------------------------
	 */
	
	public static function detectCharset($text) {
		$s = $text;
		$sa=self::_charset_prepare($s);
		$s1=self::charset_win_lowercase($sa);
		$r1='windows-1251';

		$c1=self::_charset_count_chars($s1);
		$b1=self::_charset_count_bad($s1);
		$p1=self::_charset_count_pairs($s1);
		$w1=$p1*32+$b1*64-$c1;

		$s2=self::charset_win_lowercase(self::_charset_koi_win($sa));
		$w2=-$c1; //Îסמבוםםמסעü ךמהטנמגךט koi-8r: עמע זו הטאןאחמם סטלגמכמג, קעמ ט הכÿ windows-1251
		if($w2<$w1)
		{
			$b2=self::_charset_count_bad($s2);
			$w2+=64*$b2;
			if($w2<$w1)
			{
				$p2=self::_charset_count_pairs($s2);
				$w2+=32*$p2;
				if($w2<$w1)
				{
					$r1='koi8-r';
					$w1=$w2;
				}
			}
		}

		$s2=self::charset_win_lowercase(self::_charset_utf8_win($sa));

		$c2=self::_charset_count_chars($s2);
		$w2=-$c2;
		if($w2<$w1)
		{
			$b2=self::_charset_count_bad($s2);
			$w2+=64*$b2;
			if($w2<$w1)
			{
				$p2=self::_charset_count_pairs($s2);
				$w2+=32*$p2;
				if($w2<$w1)
				{
					$r1='utf-8';
					$w1=$w2;
				}
			}
		}
		
		return $r1;

//		switch($r1)
//		{
//			case 'alt':
//				return self::_charset_alt_win($s);
//			case 'koi-8r':
//				return self::_charset_koi_win($s);
//			case 'utf':
//				return _charset_utf8_win($s);
//			default:
//				return $s;
//		}
//
//		return $s;
	}
	
	/**
	 * Âסןמלמדאעוכüםאÿ פףםךצטÿ הכÿ מןנוהוכוםטÿ ךמהטנמגךט נףססךמדמ עוךסעא
	 */
	private static function _charset_prepare($s) {
		$r = $k = 0;
		for ($i = 0; $i<strlen($s) && $r<255; $i++) {
			if(ord($s[$i])>=0x80) {
				$r++;
				$k=$i;
			}
		}
		return substr($s,0,$k+1);
	}
	
	/**
	 * Âסןמלמדאעוכüםאÿ פףםךצטÿ הכÿ מןנוהוכוםטÿ ךמהטנמגךט נףססךמדמ עוךסעא
	 */
	private static function charset_win_lowercase($s) {
		for($i=0; $i<strlen($s); $i++) {
			$c=ord($s[$i]);
			if($c>=0xc0&&$c<=0xdf)
				$s[$i]=chr($c+32);
			elseif($s[$i]>='A'&&$s[$i]<='Z')
				$s[$i]=chr($c+32);
		}
		return $s;
	}
	
	/**
	 * Âסןמלמדאעוכüםאÿ פףםךצטÿ הכÿ מןנוהוכוםטÿ ךמהטנמגךט נףססךמדמ עוךסעא
	 * count "good" symbols in russian, in windows-1251
	 */
	private static function _charset_count_chars($s) {
		$r=0;
		for($i=0; $i<strlen($s); $i++) {
			if(ord($s[$i])>=0xc0) $r++;
		}
		return $r;
	}
	
	/**
	 * Âסןמלמדאעוכüםאÿ פףםךצטÿ הכÿ מןנוהוכוםטÿ ךמהטנמגךט נףססךמדמ עוךסעא
	 * count "bad" symbols in russian, in windows-1251
	 */
	private static function _charset_count_bad($s) { 
		$r=0;
		for($i=0; $i<strlen($s); $i++) {
			switch($s[$i]) {
				case '¸':
				case '¨':
				case '«':
				case '»':
					break;
				default:
					$c=ord($s[$i]);
					if ($c>=0x80&&$c<0xc0||$c<32) $r++;
			}
		}
		return $r;
	}
	
	/**
	 * Âסןמלמדאעוכüםאÿ פףםךצטÿ הכÿ מןנוהוכוםטÿ ךמהטנמגךט נףססךמדמ עוךסעא
	 * count "bad" pairs of chars for a string in russian, in windows-1251
	 */
	private static function _charset_count_pairs($s)
	{ 
		$a=array(
			0 => 'תûü',
			1 => 'יןפ‎',
			2 => 'יפ‎',
			3 => 'זיןפץצשתûü‎‏',
			4 => 'יפש',
			5 => 'תûü',
			6 => 'חיעפץרשתû‎ÿ',
			7 => 'יןפץש',
			8 => 'תûü',
			9 => 'אבזטיףשתûü‎‏ÿ',
			10 => 'בדיןפץשתûü‎‏ÿ',
			11 => 'ינצת‎',
			12 => 'הזחית',
			13 => 'ילןת',
			14 => 'תûü',
			15 => 'בגדהזחיץשת‎‏',
			16 => 'ית‎',
			17 => 'י',
			18 => 'זי',
			19 => 'תûü',
			20 => 'בגדהזחיךןץצרשתü‎‏ÿ',
			21 => 'בזחיפץצקשתûü‏ÿ',
			22 => 'בדהזחיכםןנסעפץצקרשתü‎‏ÿ',
			23 => 'בדהזחיןספץצקשתû‎‏ÿ',
			24 => 'בדהזחיפץרשתû‎ÿ',
			25 => 'בגדהזחיךכלןסעפץצקרשתû‎‏ÿ',
			26 => 'אבגדהזחטיךכלםמןנסעףפץצקרשתûü‎',
			27 => 'אמפתûü‎‏',
			28 => 'איכנףץתûü‎',
			29 => 'אבוזטמףצקרשתûü‎‏',
			30 => 'טמףפתûü‎ÿ',
			31 => 'אמףפתûü‎'
		);
		$b=array(
			0  => 'אאאבאגאדאהאואזאחאטאיאךאכאםאמאסאעאףאפאץאצאקאראשא‎א‏אÿבדבלבעבץבצבקברבשבתבüב‏בÿגבגזגץגתג‏דחדךדעדקדÿהההץה‎ואובודוווזוטומוןוסוףופוצושו‎ו‏וÿזבזגזכזןזנזצזקז‏חחחסחעחרח‎ח‏טאטוטזטטטיטמטןטףטפטצטרטשט‎ט‏טÿיןינךחךלךקךרכבכגכחכםכרכשלגלדלץלקל‎ל‏םבםגם‎מאמגמדמומזמחמטמימךמכמלמממןמףמפמץמצמרמשמ‎מ‏מÿןלןצנחסדסהסזסחסתס‎עבעדעהעחעןערעשעתע‎ףאףבףגףזףטףיףמףףףפףץףצףשף‏ףÿפכפלץדץהץךץןץסץרץ‎צגצלצףצûקגקלקנקררנרסרקשםשנשü‎ג‎ד‎ה‎ח‎י‎ך‎ל‎ם‎ן‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ר‏‏ÿבÿדÿהÿוÿזÿחÿטÿיÿןÿנÿרÿשÿ‏ÿÿ',
			1  => 'אאאזאמאןאפאשא‎באבבבגבדבהבזבחבךבכבלבםבסבעבףבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגüג‏גÿדאדבדגדדדהדודחדטדךדכדלדםדנדסדעדףדקדרדÿהבהגהדהההזהחהךהכהלהםהמהןהנהסהעהץהצהקהרהתהûהüה‎ה‏ואובוןוףופו‎וÿזבזגזדזהזזזךזכזלזםזמזןזנזסזצזקזüז‏חבחגחדחהחוחזחחחטחךחכחלחםחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿטאט‎ךגךהךזךחךךךכךלךםךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשלבלגלדלךלכלללםלןלנלסלעלףלפלץלצלקלרלשלûלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמממפמץנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשסבסגסדסהסזסחסלסםסןסנססספסץסקסרסשסתסûסüס‎ס‏עאעבעגעדעהעחעטעךעכעלעםעןענעסעעעףעפעץעצעקערעשעתעûעüע‎ע‏ףמףףףצףשף‎ץדץהץוץטץךץכץלץםץןץנץסץעץףץרץ‎צגצטצךצלצףקגקוקךקכקלקםקמקנקעקףקרקüרגרךרכרלרםרמרןרנרסרערףרצרקרüר‏שמשנשüת‏ûבûדûזûטûןûנûףûצûרûÿüבüגüדüהüזüחüךüלüםüמüןüסüעüפüצüקüרüש‏א‏ב‏ג‏ד‏ו‏ז‏ח‏י‏ך‏ל‏ם‏ן‏ץ‏צ‏ק‏ר‏ש‏‏ÿבÿגÿדÿהÿוÿזÿטÿיÿךÿםÿנÿסÿץÿצÿקÿרÿ‏ÿÿ',
			2  => 'אאאמאףאפאשא‎באבבבגבדבהבזבחבךבלבםבסבעבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגעגףגץגצגקגרגשגתגüג‏דאדבדגדדדהדודחדטדךדלדםדסדעדקדרדÿהבהדהההזהחהךהכהלהםהןהסהעהץהצהקהרהתהüה‎ה‏הÿואוטוףופו‎זאזבזגזדזהזוזזזךזכזלזםזמזןזנזסזףזצזקזüז‏חוחזחחחךחסחעחףחצחקחרחüח‎ח‏טףטפט‎ךגךהךזךחךךךלךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכףכפכץכקכרכשכûלבלגלדלךלכלללםלןלנלסלעלףלפלץלצלקלרלשלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמפמ‎ןךןלןםןןןסןעןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏סבסגסדסהסזסחסטסםסנססספסצסקסרסשסתסüס‎עבעגעדעהעחעךעכעלעםעןעסעעעףעפעץעצעקערעשעתעüע‎ע‏ףבףגףזףטףמףןףףףפףצף‎ץאץגץדץהץוץטץךץכץלץםץןץנץסץעץףץרץ‎צגצטצךצלקגקךקכקלקםקנקעקרקüרגרךרכרלרםרןרנרסרערצרקרüר‏שאשושםשמשנשףשüת‏תÿûשüבüגüדüהüזüחüךüלüםüמüןüפüצüקüרüש‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ס‏ע‏ץ‏צ‏ק‏ר‏ש‏‏ÿבÿגÿדÿהÿוÿטÿיÿןÿנÿצÿקÿרÿ‏ÿÿ',
			3  => 'אאאךאמאפארא‎בבבגבדבהבזבחבטבךבכבלבםבמבנבסבעבףבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדאדבדגדדדהדחדךדכדלדםדמדנדסדעדףדקדרדÿהבהגהדהההזהחהטהךהכהלהםהןהנהסהעהףהץהצהקהרהתהûהüה‎ה‏הÿואוגודוזוחוןוףוץוצוקורושו‎חבחגחדחהחוחזחחחטחךחכחלחםחמחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿטזטףטפטצטשט‎ךגךהךוךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשכüלבלגלדלטלךלכלללםלןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםûםüם‎מ‏נבנגנדנהנזנחנךנכנלנןנננסנענפנץנצנקנרנשנüסאסבסגסדסהסוסזסחסטסכסלסםסןסנסססףספסץסצסקסרסשסתסûסüס‎ס‏עאעבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתעûעüע‎ףגףדףחףטףיףךףמףןףףףפףצף‎ףÿקגקךקכקלקםקמקנקעקרקüרארגרךרכרלרםרמרןרנרסרףרצרקרüר‏ÿבÿגÿדÿוÿזÿחÿטÿיÿךÿכÿםÿןÿנÿסÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
			4  => 'אאאחאףאשא‎בבבגבדבהבזבחבךבכבלבםבסבעבףבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגלגםגןגנגסגעגץגצגקגרגשגתגüג‏גÿדבדגדדדהדודחדךדלדםדסדעדףדקדרדÿהבהדהההזהחהךהכהלהםהןהנהסהעהץהצהקהרהתהûהüה‎ה‏הÿוףוץושו‎זבזגזדזהזזזךזכזלזםזןזנזסזצזקזüז‏חבחגחדחהחזחחחךחכחלחנחסחעחצחקחרחתחûחüח‏חÿטדטץט‎ךגךהךזךחךךךלךםךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשכüכ‏לבלגלדלךלכלללןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםכםםםנםסםפםץםצםקםרםשםüם‎מאמפמ‎מ‏מÿןוןךןלןםןןןסןעןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנננענפנץנצנקנרנשנüסבסדסהסזסחסםסנססספסץסצסרסשסתסûסüס‎ס‏סÿעבעדעהעחעךעכעלעםעןעסעעעףעפעץעצעקערעשעתעûעüע‎ע‏ףהףחףפץדץהץטץךץכץלץםץןץנץסץעץףץרץ‎צגצטצךצלקגקךקכקלקםקמקנקעקרקüרגרךרכרלרםרמרןרנרסרצרקרüר‏ûחûטûףûצûÿüגüדüהüזüחüםüמüןüסüפüצüקüרüש‎ד‎ה‎ח‎י‎כ‎ל‎ן‎ס‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏כ‏ל‏ס‏ע‏ץ‏צ‏ק‏ש‏‏ÿבÿגÿוÿזÿחÿךÿכÿןÿנÿצÿרÿ‏ÿÿ',
			5  => 'אאאואזאחאטאיאמאןאנאסאףאפאץאצאקאראשא‎א‏אÿבבבגבדבהבזבחבץבצבקברבשבתגבגגגדגזגןגץגשגתג‏דבדגדדדחדעדרהדהץהצה‏ואובודוהוווזוטוכוםומוףופושו‎ו‏וÿזבזגזזזלזקז‏חסחצחרחתח‎טאטבטהטוטזטטטיטמטנטףטפטצטקטרטשט‎ט‏טÿיגימיץךזךחךךךלךקכהכזכחכןכפכץכרכשלגלנלפלץלרל‎ל‏םזםכםפם‎מאמומטמימףמקמרמ‏מÿןלןןןפנשסדסזסחסשסתס‎ס‏עדעהעחעןעפעצעשעתע‎ע‏ףאףטףיףמףףףפףצףרףשף‎פלפםפספקפûץדץךץנץעץרצגצלצףקגקלקנקררגרלרןרנרצרקר‏שםשמ‎ג‎ד‎ה‎ח‎י‎כ‎ל‎ם‎ן‎נ‎ס‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏ר‏‏ÿבÿדÿוÿזÿחÿטÿיÿךÿןÿצÿקÿרÿשÿ‏ÿÿ',
			6  => 'אאאבאחאטאמאןאףאפאצארא‎בבבגבדבהבזבחבךבכבלבםבנבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגהגוגזגחגטגךגכגלגםגמגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדבדגדדדהדודחדךדלדםדמדנדסדעדקדרדÿהבהגהדהההזהחהךהלהםהןהנהסהעהץהצהקהרהתה‎ואוזוטומוףוץו‎ו‏וÿזבזגזדזהזזזךזכזלזםזמזןזנזסזףזצזקזüז‏טאטבטףטפט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכוכזכחכךכככלכםכמכןכסכעכףכפכץכקכרכשכûכüכ‏כÿלאלבלגלדלךלכלללםלןלנלסלעלפלץלצלקלרלשלûלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמבמגמהמזמטמכמממןמעמףמפמץמצמשמ‎מ‏מÿןאןוןטןךןלןםןמןןןנןסןעןףןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנûנüנ‏נÿסאסבסגסדסהסוסזסחסטסכסלסםסמסןסנסססעסףספסץסצסקסרסשסתסûסüס‎ס‏סÿףבףגףדףהףחףלףמףןףףףפףצףרף‎צגצוצטצךצלצמקאקגקוקךקכקלקםקמקנקעקףקרקüüבüגüדüהüזüחüךüלüםüמüןüפüצüקüרüש‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏ל‏ם‏ן‏ס‏ע‏ץ‏צ‏ק‏ר‏ש‏‏',
			7  => 'א‎בבבגבדבהבזבחבךבלבםבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגהגזגחגלגןגסגעגץגצגקגרגשגתגüג‏דבדגדדדהדחדךדלדסדעדקדרדÿהבהדהההזהחהכהלהןהסהעהץהצהקהרהתה‎ה‏ואודוהוזוחומוןוסוףוץוקושו‎זבזגזדזהזזזךזכזלזםזמזןזנזסזצזקזüז‏חבחדחהחוחזחחחטחךחכחלחמחסחעחףחצחקחרחתחûחüח‎ח‏חÿטבטחטןטפטץטשט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשכüלבלגלדלךלכלללנלסלעלפלץלצלקלרלשלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשם‎מאמזמטמףמפמצמ‎מ‏מÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏סאסבסגסדסהסוסזסחסטסכסלסםסמסןסנסססעסףספסץסצסקסרסשסתסûסüס‎ס‏סÿעאעבעגעדעהעועחעךעכעלעםעןענעסעעעףעפעץעצעקערעשעתעûע‎ע‏עÿףגףדףזףמףףףפףצףרף‎צגצוצטצךצלקאקגקךקכקלקםקמקנקעקרקüרארגרורךרכרלרםרמרןרנרסרערףרצרקרüר‏ûהûזûטûכûןûעûףûרûÿüגüדüהüזüחüטüךüםüמüןüסüפüצüקüרüש‎ג‎ד‎ה‎ח‎י‎ך‎כ‎ל‎ן‎נ‎ס‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ם‏ן‏נ‏ס‏ע‏ץ‏צ‏ק‏ר‏ש‏‏ÿדÿהÿזÿחÿךÿןÿנÿסÿץÿצÿרÿ‏ÿÿ',
			8  => 'אאאואזאטאיאמאףאץאקאשא‎א‏בגבדבזבחבלבעבץבצבקבשבתבÿגבגגגדגהגזגחגלגןגעגשגתג‏דבדגדדדךדסדקדÿהבהדהההכהןהץהקהרהתהüה‎ואובוווזוטוךומוןוףופוקורושו‎ו‏וÿזבזגזדזזזכזלזןזנזצזקזüז‏חחחעחצחüח‎ח‏טאטבטגטדטהטוטזטחטטטיטךטכטםטמטןטעטףטפטץטצטקטרטשט‎ט‏טÿיגידיהיויחיךיכילימיניפיץיקירךהךזךחכבכדכזכחכלכםכןכעכפכץכקכרכשלנלעלץלרלשלüל‎ל‏םכםנםרםשם‎מומזמטמימממףמפמצמקמרמשמ‏מÿןלןפןצןקןüנדנחנפנץנצנשנüסבסדסזסחסנספסשסתס‎עבעדעהעחעןעפעץערעשעתע‏ףאףבףגףוףזףחףטףיףמףנףףףפףץףצףרףשף‎ף‏ףÿפכפםפקץדץהץךץלץעץרץ‎צגצלקגקכקלקנקררגרןרנרסרערצרקר‏שמשü‎ג‎ד‎ה‎ח‎י‎ך‎כ‎ל‎ם‎ן‎נ‎ס‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏ל‏נ‏ס‏ץ‏צ‏ק‏ר‏‏ÿבÿדÿהÿטÿיÿךÿנÿסÿצÿקÿרÿש',
			9  => 'גבגגגדגהגוגזגחגטגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדבדגדדדהדודחדטדךדכדלדםדמדנדסדעדףדקדרדÿהבהגהדהההחהךהכהלהםהןהנהסהץהצהקהרהתהûהüה‎ה‏ואובוגודוהוווזוחוטויוךולומוןוסועוףופוץוצוקורושו‎ו‏וÿחבחגחדחהחזחחחטחךחכחלחםחמחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿךגךהךזךחךךךלךםךנךעךצךקךרכבכגכדכהכזכךכככלכםכןכסכעכפכץכקכרכשכüכ‏כÿלבלגלדלךלללםלןלנלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםשםüם‎מאמבמומזמטמימכמלמממןמסמףמפמץמצמקמרמשמ‎מ‏מÿןאןטןךןכןלןםןמןןןנןסןעןףןצןקןרןûןüןÿנאנבנגנדנהנונזנחנטנךנכנלנםנןנננסנענףנפנץנצנקנרנשנûנüנ‏נÿסגסדסהסוסזסחסכסםסןסנססספסץסצסקסרסשסתסüס‎ס‏עבעגעדעהעחעךעכעלעםעןעעעפעץעצעקערעשעתעûעüע‎ע‏עÿפכפלפםפנפספעפפפקפûץגץדץהץוץטץךץכץלץםץמץןץנץסץעץףץרץ‎צגצטצךצלקגקוקךקכקלקםקמקנקעקףקרקüרגרךרכרלרםרמרןרנרסרערצרקרüר‏',
			10 => 'אאאשא‎גבגגגדגהגזגחגךגכגלגםגןגנגסגעגץגצגקגרגשגתגüג‏גÿהאהבהגהדהההוהזהחהטהךהכהלהםהןהנהסהעהףהץהצהקהרהתהûהüה‎ה‏הÿובודוזוטומוףופוץוצוקורושו‎ו‏וÿזאזבזגזדזהזזזטזךזכזלזםזמזןזנזסזףזצזקזüז‏חבחגחדחהחזחחחךחכחלחםחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿטדטזטצטשט‎ט‏ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשלבלגלדלטלךלכלללםלמלןלנלסלעלףלפלץלצלקלרלשלûלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ם‏מאמצנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנשנüסבסהסזסחסכסלסנסססץסקסשסתסüס‎ס‏עבעגעדעהעחעךעכעלעןעסעעעפעץעצעקערעשעתעüע‎ע‏ףאףדףזףיףמףפףצף‎צאצגצךצלצמצףצûקאקגקטקךקכקלקםקמקנקעקףקרקüרגרךרכרלרםרמרןרנרסרערצרקרüר‏',
			11 => 'אאאמאפא‎בבבגבדבהבזבחבךבכבלבסבעבץבקברבשבתבüב‏בÿגבגגגדגהגזגחגלגןגנגעגףגץגצגקגרגשגתגûגüג‏גÿדבדגדדדהדחדךדכדלדםדסדעדקדרדÿהבהגהדהההזהחהךהכהלהןהנהעהץהצהקהרהתהüה‎הÿואזבזגזדזהזזזךזכזלזמזןזנזסזףזצזקזüז‏חבחגחדחהחזחחחטחלחמחנחסחצחקחרחתחûחüח‎ח‏חÿטףט‎ךהךזךחךךךלךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכעכפכץכקכרכשלבלגלדלךלכלללםלןלנלעלףלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםקםרםשםüם‎ם‏מ‎מ‏ןךןכןלןםןןןנןסןעןפןצןקןרןüסבסגסדסהסזסחסכסלסםסןסנססספסץסצסקסרסשסתסûסüס‎ס‏עבעגעדעהעחעטעךעכעלעםעןענעסעעעפעץעצעקערעשעתעüע‎ע‏עÿףשפטפכפלפםפמפנפספעפףפפפקפûץאץדץהץוץךץכץלץםץןץנץסץעץףץרץ‎קגקכקלקנקעקררארגרטרךרכרלרםרמרןרנרסרערףרצרקרüר‏שםשמשנשףשüûדûהûחûטûנûףûצûÿ‏א‏ד‏ו‏יÿבÿט',
			12 => 'אאאבאמאןאףאשבבבגבדבהבזבחבךבלבםבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגוגזגחגטגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדאדבדגדדדהדודחדטדךדלדמדנדסדעדףדקדרדÿואוןוףו‎טאטבטזטשט‎ךגךהךזךחךךךכךלךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכמכןכסכעכףכפכץכקכרכשכûכüלבלגלדלךלכלןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאןךןלןםןןןסןפןצןקןÿנבנגנדנהנזנחנךנכנלנםנמנןנננסנענפנץנצנקנרנשנûנüנ‏נÿסבסגסדסהסזסחסכסלסםסןסנססספסץסצסקסרסשסתסûס‎ס‏עאעבעגעדעהעחעךעכעלעםעמעןענעסעעעףעפעץעצעקערעשעתעûעüע‎ע‏עÿףבףגףוףטףיףמףףףצף‎ףÿפכפלפםפנפספעפפפקפûץאץגץדץהץוץטץךץכץלץםץןץנץסץעץףץרץ‎צגצטצךצלצמקגקךקכקלקםקמקנקעקרקüרארגרךרכרלרםרמרןרנרסרערףרצרקרüר‏שאשםשמשנשףשüûבûהûזûחûטûןûנûףûצûשûÿüבüגüדüזüחüךüלüםüמüןüפüצüקüרüש‎ג‎ד‎ה‎ח‎י‎ך‎כ‎ל‎ן‎ס‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏ל‏ן‏נ‏ס‏ע‏ץ‏צ‏ק‏ר‏ש‏‏ÿבÿהÿוÿזÿחÿיÿןÿנÿץÿצÿ‏ÿÿ',
			13 => 'אאאפא‎בבבגבדבהבזבחבטבךבכבלבםבמבנבסבעבץבצבקברבשבתבûבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגנגסגעגץגצגקגרגשגתגûגüג‏גÿדבדדדחדךדלדםדקדרדÿהבהגהדהההחהךהןהקהתהüה‎הÿושזבזגזדזהזזזךזכזלזםזמזןזנזסזצזקזüז‏חבחגחדחהחזחחחךחכחלחםחנחסחעחצחקחרחתחüח‎ח‏חÿטףט‎ךהךזךחךךךלךסךקךרכאכבכגכדכהכוכזכחכךכככלכםכמכןכסכעכףכפכץכקכרכשכûכüכ‏כÿםבםגםדםהםזםחםךםכםםםנםסםפםץםצםקםרםשםüם‎משנבנגנדנהנזנחנךנכנלנםנןנננסנענףנפנץנצנקנרנשנûנüנ‏נÿסדסהסזסחסנסץסקסרסשסתסüס‎ס‏סÿעבעגעהעחעלעןעעעפעץעצעקערעשעתעüע‎ףבףדףחףטףמףןףףףפףץףצף‎פלפםפספעפפפקפûץאץגץדץהץטץךץכץלץםץןץסץעץףץרץ‎צגצךצלקגקךקכקלקםקנקעקרקüרגרורךרכרלרםרמרןרנרסרףרצרקרüר‏שאשושםשמשנשףשüûבûדûהûזûחûטûךûסûףûצûשûÿüבüגüהüחüלüםüןüפüצüקüש‎ג‎ד‎ה‎ח‎י‎ך‎כ‎ל‎ם‎נ‎ס‎ע‎פ‎ץ‎ÿ‏ב‏ג‏ד‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏נ‏צÿבÿהÿןÿנÿצ',
			14 => 'אאאבאגאדאהאואזאטאיאכאלאמאףאפאץאצאקאראשא‎א‏אÿבצב‏גהגזגץגתג‏דגדדדחדךדסדקדרדÿה‎ה‏ואובוווטונוףופושו‎וÿזבזגזכזןזנזסזקז‏חסחעחצחקחרחתח‎ח‏טאטבטוטזטטטיטמטןטףטפט‎ט‏טÿיגידיויחיןיניפיץירךהךזךלךצךקכפלגלדלץלרלשל‎ל‏םץםרם‎מאמגמדמומזמחמטמימכמלמףמפמרמ‎מ‏מÿןלןפןרסדסחסשס‎ע‎ע‏ףאףוףזףטףיףמףנףףףפףצףרףשף‏ףÿפלפםפעפקץדץהץךץןץסץ‎צףצûקלקנקררנרסרצרקשמ‎ה‎י‎ן‎ס‎ץ‎ÿ‏א‏ב‏ג‏ד‏ז‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏רÿדÿוÿטÿןÿצÿקÿרÿ‏ÿÿ',
			15 => 'אאאמא‎ואובוטולוףופו‎וÿטבטףטפט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשלאלבלגלדלולךלכלללםלמלןלנלסלעלףלפלץלצלקלרלשלûלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ם‏מאןלןןןנןסןעןפןצןקןרןüןÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏סבסגסדסהסזסחסכסלסםסןסנססספסץסצסקסרסשסתסüס‎ס‏סÿעבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתעüע‎ע‏עÿףגףוףזףטףיףלףמףףףפףצף‎ףÿפופכפלפםפמפספעפףפפפקפûצאצגצוצךצלצמקגקךקכקלקםקמקנקעקףקרקüרארגרךרכרלרםרמרןרנרסרערצרקרüר‏ûבûהûחûטûךûםûןûסûףûצûקûÿüבüגüדüהüזüחüטüךüלüםüמüןüסüעüפüצüקüרüשÿבÿגÿדÿהÿוÿזÿחÿטÿיÿךÿלÿםÿןÿנÿצÿקÿרÿ‏ÿÿ',
			16 => 'א‎בבבגבדבהבזבחבךבלבעבץבצבקברבשבתבûבüבÿגבגגגדגהגזגחגךגכגלגןגנגסגעגץגצגקגרגשגתדבדגדדדהדחדךדלדעדקדÿהבהגהדהההחהךהכהןהנהעהץהקהרהתהüה‎ו‎זבזגזדזזזכזלזמזןזנזסזקזüז‏חבחגחדחהחזחחחלחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿט‎ךהךזךחךךךלךנךצךקךרכבכגכדכהכזכךכככלכםכןכסכעכפכץכקכרכשכ‏לבלגלדלךלללםלןלנלסלעלפלץלצלרלשלüל‎ל‏םגםדםהםזםחםךםכםםםנםעםפםץםצםקםרםשםüם‎ןךןלןןןסןעןפןצןקןרןüנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנûנüנ‏נÿסבסגסדסהסזסחסכסלסםסנססספסץסצסקסרסשסתסüס‎ס‏עבעדעהעןעעעץעצעקערעשעתע‎ע‏ףגףמףףףצף‎פכפלפנפספעפףפפפקפûץגץדץכץנץעץרצגצךצלקגקךקלקםקמקנקעקרקüרגרכרלרןרסרערצרקרüר‏שאשםשמשנשףשüûטûנûףûÿüגüהüזüחüםüמüןüפüצüקüרüש‏א‏ב‏ג‏ה‏ו‏ז‏י‏ן‏נ‏צ‏‏ÿטÿנÿצ',
			17 => 'אאאחאטאמאשבבבגבדבהבזבחבךבלבםבסבעבףבץבצבקברבשבתבüבÿגבגגגדגהגזגחגךגכגלגםגןגסגעגץגצגקגרגשגתגüג‏דאדבדגדדדהדחדךדלדסדעדקדרדÿהבהדהההזהחהךהכהלהםהןהסהעהץהצהקהרהתהûהüה‎ה‏הÿוזופו‎זבזגזדזהזזזךזכזלזםזמזןזנזסזףזצזקזüז‏חבחגחדחהחוחזחחחטחךחכחלחםחמחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿטףטשט‎ךהךזךחךךךלךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשלבלגלדלךלכלללםלןלעלפלץלצלקלרלשלüל‎ל‏םבםגםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמ‎מÿןךןלןםןןןסןעןפןצןקןרןüנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏נÿסבסדסהסזסחססספסץסצסרסשסתסüס‎ס‏עהעחעןעעעפעץערעשעתףףףצפכפלפםפנפספעפףפפפקפûץדץהץךץלץםץןץסץעץרץ‎צךצלצףצûקגקךקלקםקמקנקעקרקüרגרךרכרלרםרןרנרסרצרקרüר‏שאשטשםשמשנשףשüת‏ûבûהûזûחûטûךûףûצûקûרûÿüגüדüהüזüחüטüםüמüןüסüפüצüקüרüשüÿ‎ג‎ד‎ה‎ח‎י‎כ‎ן‎ס‎ע‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ו‏ח‏י‏ל‏ם‏ן‏ע‏ץ‏צ‏ק‏ש‏‏ÿבÿגÿטÿיÿכÿןÿנÿרÿ‏ÿÿ',
			18 => 'אאאמא‎בבבגבדבהבובזבחבךבלבםבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגהגזגחגךגלגםגןגסגעגץגצגקגרגשגתגüג‏דבדגדדדהדחדטדךדכדלדםדסדעדףדקדרדÿהבהגהדהההזהחהךהכהלהםהןהנהסהעהףהץהצהקהרהתהüה‎ה‏הÿוףו‎חבחדחהחוחזחחחטחךחכחלחםחנחסחעחףחצחקחרחתחüח‎ח‏חÿךגךהךזךחךךךלךעךצךקךרכבכגכדכהכזכךכככלכםכןכסכעכפכץכקכרכשלבלגלדלךלכלללםלןלנלסלעלפלץלצלקלרלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ןךןלןםןןןסןעןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנסנענפנץנצנקנרנשסבסדסהסזסחסןססספסץסצסרסשסתסüס‎עבעגעדעהעחעךעכעלעןעסעעעפעץעצעקערעשעתעûעüע‎ע‏ףגףףפאפכפלפםפנפספעפפפקפûץדץהץוץךץלץםץןץנץסץעץרץ‎צגצטצךצלקגקךקכקלקםקמקנקעקרקüרךרלרםרמרןרנרסרצרקרüר‏שםשמשנשףשüת‏תÿûבûזûחûטûעûףûצûÿüגüדüזüחüםüמüןüצüקüרüש‎ג‎ד‎ה‎ח‎י‎כ‎ל‎ן‎נ‎ס‎ע‎פ‎ץ‎ÿ‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ם‏ן‏ס‏ע‏ץ‏צ‏ק‏ש‏‏ÿהÿוÿטÿכÿנÿקÿ‏',
			19 => 'אאאבאגאדאואזאטאךאלאמאןאףאפאץאקאראשא‎א‏אÿבגבדבהבחבלבעבץברבשב‏גבגגגדגהגזגחגלגןגנגעגףגץגצגקגשגתג‏דבדגדהדחדךדלדסדעדקדרדÿהבהדהןהץהצהקהתה‎ואובודוווזוטוךוכוםומוןוףופוצוקושו‎ו‏וÿזגזדזלזןזנזצז‏חבחדחזחחחעחצחרחתח‎ח‏חÿטאטבטגטדטוטזטטטיטלטמטןטףטפטץטקטרטשט‎ט‏טÿידיויחיכימיןיניפיץיצירךהךזךחךקךרכבכדכזכחכלכםכןכעכץכקכרכשלגלדלןלעלץלרלשל‎ל‏םבםגםזםחםכםנםפםץםקםשם‎ם‏םÿמאמגמדמומזמטמימכמלמםמממןמףמפמץמצמקמרמשמ‎מ‏מÿןלןסןעןפןרנחנפנץנשסבסדסהסזסחספסץסצסקסרסשסתס‎ס‏עדעהעחעלעןעפעץעצערעשעתע‎ףאףבףגףדףהףוףזףחףטףיףךףםףמףןףנףסףעףףףפףץףצףקףרףשף‎ף‏ףÿפאפלפםפמפנפספעפקפûץהץנץ‎צאצגצלצמצףצûקגרגרלרןרנרסרערצר‏שנשü‎ג‎ד‎ה‎ח‎י‎ך‎ל‎ן‎פ‎ץ‎ÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏ר‏‏ÿבÿדÿהÿוÿזÿטÿיÿךÿםÿןÿנÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
			20 => 'אאאהאואזאטאמאןאפאצאקאשא‎א‏אÿואובודוזוחוןוףופוצוקושו‎ו‏טגטזטףטפטץטשט‎כבכגכדכהכזכחכךכככלכםכסכעכפכץכקכרכשכûכüלבלגלדלטלךלכלללםלןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםאםבםגםדםהםוםזםחםטםךםכםםםמםנםסםעםףםפםץםצםקםרםשםüם‎ם‏םÿמאמומזמחמטמממןמףמפמץמצמקמרמשמ‎מ‏מÿנבנגנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנüנ‏נÿסאסבסגסדסהסזסחסטסכסלסםסןסנסססףספסץסצסקסרסשסתסûסüס‎ס‏סÿעבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתע‎ע‏ףאףבףגףהףוףזףטףיףךףכףלףמףןףסףףףפףץףקףרףשף‎ףÿפכפלפםפנפספעפפפקפûקאקגקוקךקכקלקםקמקנקעקףקרקüûבûדûהûוûזûחûטûיûךûכûלûםûןûסûעûףûץûצûקûרûשûÿ',
			21 => 'אאאדאחאפאצאקאראשגבגגגדגהגוגזגחגטגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿדבדגדדדהדודחדטדךדכדלדםדנדסדעדףדקדרדÿהאהבהגהדהההוהזהחהטהךהכהלהןהנהסהעהףהץהצהקהרהתהûהüה‎ה‏הÿואובודוהוווזוחוטוךוכוןוסועוףופוץוצוקושו‎ו‏וÿטןטףטפטצטרט‎ךאךגךהךוךזךחךטךךךכךלךםךסךעךףךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכפכץכקכרכשכüלבלגלדלךלכלםלןלנלסלעלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםûםüם‎מטמממצמרמ‎מ‏מÿןוןטןךןכןלןםןןןסןעןףןפןצןקןרןûןüןÿנבנגנדנהנזנחנךנכנלנםנןנננסנענפנץנצנקנרנשנûנÿסאסבסגסדסהסזסחסכסלסםסןסנסססףספסץסצסקסרסשסתסûסüס‎ס‏עבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתעüע‎ע‏ףבףגףדףחףטףיףלףםףמףסףףףפףץףצףקףשף‎ףÿרארגרךרכרלרםרןרנרסרערףרצרקרüר‏‎ג‎ד‎ה‎ח‎י‎ם‎נ‎ס‎פ‎ץ‎ÿ',
			22 => 'אאאבאגאדאהאזאחאטאיאךאמאסאףאפאצאקאראשא‎גאגבגגגדגהגזגחגךגכגלגםגמגןגנגסגעגףגץגצגקגרגשגתגûגüג‏גÿואובוזוטופוצוקורושו‎וÿטבטדטזטףטץטצטקטרטשט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרלבלגלדלולטלךלכלללםלמלןלנלסלעלףלפלץלצלקלרלשלûלüל‎ל‏לÿמאמבמהמומזמחמטמכמםמממןמסמעמףמפמץמצמקמרמשמ‎מ‏מÿףאףבףגףדףהףוףטףךףכףלףמףןףנףסףעףףףפףץףצףקףרףשף‎ףÿûבûגûהûזûחûטûךûכûםûנûסûעûףûץûצûקûרûשûÿ',
			23 => 'אאאבאחאמאןאףאפאצאקא‎גבגגגדגהגזגחגטגךגכגלגםגןגנגסגעגץגצגקגרגשגתגüג‏גÿואוזומוףופוצושו‏טבטהטזטחטמטןטףטפט‎ךגךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכףכפכץכקכרכשכûכüכ‏כÿלבלגלדלולטלךלכלללםלןלנלסלעלףלפלץלצלקלרלשלüל‎ל‏לÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ם‏מאמבמגמדמהמומזמחמטמכמממנמסמעמףמפמץמצמרמשמ‎מ‏מÿנאנבנגנדנהנזנחנטנךנכנלנםנמנןנננסנענףנפנץנצנקנרנשנûנüנ‏נÿעבעגעדעהעחעךעכעלעםעןענעסעעעפעץעצעקערעשעתעüע‎ע‏ףאףוףחףטףיףךףמףףףפףצףקף‎רגרךרכרלרםרמרןרנרסרערצרקרüר‏üבüגüדüהüזüחüךüלüםüמüןüפüצüקüרüש',
			24 => 'אאאחאטאמאףאצא‎גבגגגדגהגזגחגךגכגלגםגמגןגנגסגעגףגץגצגקגרגשגתגüג‏גÿואוזומוצושו‎טאטדטהטזטחטטטמטףטצטקט‎ךהךזךחךךךכךלךםךנךסךעךצךקךרכבכגכדכהכזכחכךכככלכםכןכסכעכףכפכץכקכרכשכüלבלגלדלולךלכלללםלמלןלנלסלעלףלפלץלצלקלרלשלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםפםץםצםקםרםשםüם‎מאמהמזמחמטמממץמצמקמרמשמ‎מ‏מÿןוןךןכןלןםןןןסןעןףןפןצןקןרןûןüןÿנאנבנגנדנהנונזנחנךנכנלנםנמנןנננסנענפנץנצנקנרנשנûנüנ‏נÿסאסבסגסדסהסוסזסחסטסכסלסםסמסןסנסססעסףספסץסצסקסרסשסתסûסüס‎ס‏סÿעבעגעדעהעחעךעכעלעםעןעסעעעפעץעצעקערעשעתעüע‎ע‏עÿףגףדףהףזףחףטףךףםףמףןףףףפףץףצף‎ףÿצאצגצטצךצלצמצףקגקוקטקךקכקלקםקמקנקעקףקרקüüבüגüדüהüוüזüחüךüלüםüמüןüפüצüקüרüש‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏ס‏ץ‏צ‏ק‏ר‏ש‏‏',
			25 => 'אאאבאזאחאטאמאןאנאףאפאצאקאראשא‎ואוחוףוץוצושו‎ו‏וÿטאטבטדטהטזטחטטטמטנטסטףטפט‎ט‏טÿםבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎ם‏םÿמאמגמהמומזמחמטמימךמכמםמממןמנמסמעמףמפמץמצמקמרמשמ‎מ‏מÿנאנבנגנדנהנזנחנךנכנלנםנמנןנננסנענףנפנץנצנקנרנשנûנüנ‏ףאףבףגףדףהףוףזףחףטףיףךףכףלףמףףףפףץףצףקףרף‎ףÿüבüגüדüהüוüזüחüטüךüלüםüמüןüסüעüפüצüקüרüשüÿ',
			26 => 'ואובוגודוווטויוםומוןועוףופוצוקושו‎ו‏וÿ‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ן‏נ‏ס‏ץ‏צ‏ק‏ר‏ש‏‏ÿבÿדÿהÿוÿזÿטÿיÿךÿלÿןÿץÿצÿקÿרÿשÿ‏ÿÿ',
			27 => 'בבבגבדבהבזבחבלבסבעבץבצבקברבשבתב‏בÿגבגגגדגהגזגחגכגלגןגנגסגעגץגצגשגתגüג‏גÿדבדגדדדהדודחדךדלדסדעדףדקדרהבהדהההזהחהךהלהןהסהעהץהצהקהרהתהûהüה‎ה‏הÿואובוגודוווזוטויוךוכוםומוןונוסועוףופוצוקורושו‎ו‏וÿזבזגזכזלזןזנזסזףזצזקזüז‏חבחהחזחחחטחךחלחנחסחצחקחרחתחüח‎ח‏חÿטאטבטגטהטוטזטחטטטיטךטכטלטםטמטןטנטעטףטפטץטצטקטרטשט‎ט‏טÿיגידיויחיךיכיליםימיניסיפיץיציקירךהךזךחךךךלךסךעךצךקכבכגכדכזכחכככלכםכןכעכפכץכקכרכשכ‏לגלדלכלללםלנלעלפלץלצלרלשלüל‎ל‏םבםגםדםהםזםחםכםנםעםפםץםצםרםשם‎ןלןןןסןעןפןצןרןûנבנדנהנזנחנכנלנןנננסנענפנץנצנקנשסבסדסהסזסחסםסנססספסצסשסתס‎ס‏עבעדעהעחעלעןעעעפעץעצעקערעשעתע‎ע‏ףאףבףגףדףוףחףטףיףךףכףלףםףמףןףנףסףעףףףפףץףצףרףשף‎ף‏ףÿץדץהץךץלץןץנץסץףץרץ‎צטצךצלצמצףצûקגקלקנקעקרקüרלרןרנרסרערקר‏שאשםשמשנשüÿבÿדÿהÿוÿזÿחÿטÿיÿךÿכÿלÿםÿןÿנÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
			28 => 'בבבגבדבהבזבחבךבכבלבםבנבסבעבץבצבקברבשבתבüב‏בÿגבגגגדגהגזגחגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגüג‏גÿדבדגדדדהדחדךדכדלדםדנדסדעדקדרדÿהבהגהדהההזהחהטהךהכהלהםהןהנהעהףהץהצהקהתהûהüה‎ה‏הÿואובוווזוטוכוםומוףוץוצוקושו‎ו‏וÿזבזגזדזהזזזטזךזכזלזםזמזןזנזסזףזצזקזüז‏חבחדחהחזחחחכחלחנחסחעחצחקחרחתח‎ח‏טאטבטגטדטהטוטזטחטטטיטךטכטםטמטןטסטעטףטפטקטשט‎ט‏טÿךגךהךזךחךךךלךנךעךצךקךרלבלגלדלךלכלללםלןלנלסלעלפלץלצלקלרלשלüל‎ל‏םבםגםדםהםזםחםךםכםםםנםסםעםפםץםצםקםרםשםüם‎מאמבמגמדמהמומזמחמטמימךמכמלמממןמסמףמפמץמצמקמרמשמ‎מ‏מÿןךןכןלןםןמןןןנןסןףןפןצןקןרןûןüןÿסגסדסהסוסזסחסכסלסםסןסנססספסץסצסקסרסשסתסüס‎ס‏עבעגעדעהעחעךעכעלעןעסעעעפעץעצעקערעשעתעüע‎ע‏עÿפופכפלפםפספעפפפקצגצךצלקגקךקכקלקםקנקעקרקüרגרךרכרלרםרןרנרסרערצרקרüר‏שםשמשנשü‏א‏ב‏ג‏ד‏ה‏ו‏ז‏י‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏ר‏‏ÿבÿהÿוÿזÿחÿטÿיÿכÿןÿסÿעÿצÿקÿרÿשÿÿ',
			29 => 'גבגגגדגהגזגחגךגכגםגןגסגעגףגץגצגקגרגשגתגûגüג‏גÿדאדבדגדדדהדחדטדךדכדלדםדנדסדעדףדקדרדÿהבהזהחהךהכהםהמהןהנהסהעהףהץהצהקהרהתהûהüה‎ה‏הÿחאחבחגחדחהחזחחחךחכחלחםחנחסחעחףחצחקחרחתחûחüח‎ח‏חÿיגידיהיויחיךילימיןיניעיץיציקירךהךוךזךךךכךלךםךעךצךקךרכבכגכדכהכזכחכךכםכמכןכסכעכפכץכקכרכשכûכ‏כÿלגלדלךלכלםלנלסלעלפלץלצלקלרלשלûלüל‎ל‏לÿםאםבםזםחםךםכםנםףםפםץםקםרםשםûםüם‎ם‏םÿןאןוןךןכןלןםןנןסןעןףןפןצןקןרןûןüןÿנבנדנהנזנךנלנןנננפנץנצנקנרנשנüנ‏נÿסאסבסגסדסהסוסזסחסטסכסלסםסמסןסנסססףספסצסקסרסשסתסûסüס‎ס‏סÿעבעגעדעהעחעכעלעןעסעעעפעץעצעקערעשעתעüע‎ע‏עÿפאפכפלפםפמפנפספעפףפקפûץגץדץהץוץטץךץכץלץןץנץסץעץףץרץ‎ÿבÿגÿדÿהÿוÿזÿחÿטÿיÿכÿלÿםÿןÿנÿסÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
			30 => 'אאאבאגאדאהאואזאחאטאיאךאכאלאמאןאסאעאףאפאץאצאקאראשא‎א‏אÿבבבדבהבזבחבלבנבסבעבץבצבקברבשבתבüב‏גאגבגגגדגהגזגחגךגכגלגםגןגנגסגעגףגץגצגקגרגשגתגüג‏גÿדבדגדדדהדחדטדךדכדלדםדנדסדעדףדקדרדÿהבהגהדהההחהךהכהלהןהנהעהץהקהרהתהûה‎ה‏ואובוגודוהוווזוחוטויוךוכוםומוןונוסוףופוץוצוקורושו‎ו‏וÿזבזגזדזהזזזךזכזלזמזןזנזסזףזצזקזüז‏חבחגחהחחחךחכחלחנחסחעחצחקחרחתחüח‎ח‏חÿיגידיהיויחיךיכיםימיןיניסיעיפיץיציקירךהךזךחךךךכךלךנךעךצךקךרכאכבכגכדכהכזכחכךכלכםכמכןכסכעכףכפכץכקכרכשכûלבלגלדלכלללםלןלנלסלעלףלפלץלצלקלרלשלüל‎ל‏לÿםבםגםהםזםחםכםםםנםסםעםפםקםרםשם‎ם‏ןאןכןלןםןמןןןנןסןעןףןפןצןקןרןûןüןÿנבנגנדנהנזנחנכנלנננסנענפנץנצנקנרנשנ‏סבסגסדסהסזסחסכסלסםסןסנסססףספסץסצסקסרסשסתס‎עבעגעדעהעחעכעלעןענעעעפעץעצעקערעשעתעüע‎ע‏עÿץגץדץהץךץכץלץןץנץסץעץרץ‎צאצגצוצךצלצמצףצûקגקכקלקנקעקררגרורטרכרלרמרןרנרסרערצרקרüר‏שםשמשנשü‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ס‏ץ‏צ‏ק‏ר‏ש‏‏',
			31 => 'בבבגבדבהבובזבחבךבלבםבסבעבףבץבצבקברבשבתבûב‏בÿגבגגגדגהגזגחגלגןגנגעגץגצגקגשגתג‏דבדגדדדהדחדלדנדעדרדÿהבהגהדהההזהחהכהלהןהסהעהץהצהרהתה‎ואובודוווזוחוטויוכוםומוןונוסוףופוץוצוקושו‎ו‏וÿזגזדזהזזזכזלזמזןזנזסזצזקזüז‏חבחהחזחחחלחנחסחעחצחרחתח‎ח‏טאטבטגטדטהטוטזטטטיטךטכטלטמטןטנטסטעטףטפטץטרטשט‎ט‏טÿיגידיהיויחיכיליםימיןיניפיץיקירךגךהךזךחךךךלךנךעךצךקכבכגכדכהכוכזכחכככלכםכןכפכץכקכרכשכÿלגלדלללםלנלעלפלץלקלרל‎ל‏לÿםבםזםחםכםנםעםפםץםרם‎ןכןלןןןנןסןעןפןצןרןüןÿנבנגנדנזנחנןנננענפנץנצנרנשנüנ‏נÿסבסגסדסהסזסחסלסןסנססספסץסצסקסרסשסתס‎ס‏עבעדעהעחעכעלעןענעעעפעץעצעקערעשעתע‎ע‏עÿץגץדץהץוץךץלץמץנץסץףץרץ‎צגצלצמצףקגקכקלקנקעקררארגרלרמרןרנרסרערףרצרקרüר‏שמשנשü‏א‏ב‏ג‏ד‏ה‏ו‏ז‏ח‏י‏ך‏כ‏ל‏ם‏ן‏נ‏ץ‏צ‏ק‏ר‏‏ÿבÿגÿדÿהÿוÿזÿחÿטÿיÿךÿכÿםÿןÿנÿעÿץÿצÿקÿרÿשÿ‏ÿÿ',
		);
		$res=0;
		for($i=0;$i<strlen($s)-1;$i++) {
			$c1=$s[$i];
			if($c1<'א'||$c1>'ÿ') continue;
			$c2=$s[$i+1];
			if($c2<'א'||$c2>'ÿ') continue;
			$i1=ord($c1)-ord('א');
			if(strpos($a[$i1],$c2)!==false) {
				$res++;
				continue;
			}
			if($i>=strlen($s)-2) continue;
			$c3=$s[$i+2];
			if($c3<'א'||$c3>'ÿ') continue;
			$i2=ord($c2)-ord('א');
			if(strpos($a[$i2],$c3)!==false) {
				$res++;
				$i++;
				continue;
			}
			$l=0;
			$r=strlen($b[$i1])/2-1;
			while($l<=$r) {
				$c=$l+(($r-$l)>>1);
				$ca=$b[$i1][$c*2];
				$cb=$b[$i1][$c*2+1];
				if($ca==$c2&&$cb==$c3) {
					$res++;
					break;
				}
				if($ca<$c2||$ca==$c2&&$cb<$c3)
					$l=$c+1;
				else
					$r=$c-1;
			}
		}
		return $res;
	}
	
	/**
	 * Âסןמלמדאעוכüםאÿ פףםךצטÿ
	 */
	private static function _charset_alt_win($s) {
		for($i=0;$i<strlen($s);$i++) {
			$c=ord($s[$i]);
			if($c>=0x80&&$c<=0x9f) $s[$i]=chr($c-0x80+0xc0);
			elseif($c>=0xa0&&$c<=0xaf) $s[$i]=chr($c-0xa0+0xe0);
			elseif($c>=0xc0&&$c<=0xdf) $s[$i]=chr($c-0xc0+0x80);
			elseif($c>=0xf0&&$c<=0xff) $s[$i]=chr($c-0xf0+0xa0);
		}
		return $s;
	}
	
	/**
	 * Âסןמלמדאעוכüםÿ פףםךצטÿ
	 */
	private static function _charset_koi_win($s) {
		$kw = array(
			//00   01   02   03   04   05   06   07   08   09   0a    0b   0c    0d   0e   0f
			0x80, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,  139, 140,  141, 142, 143, //0x80 - 0x8f
			144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 0xbb, 156, 0xab, 158, 159, //0x90 - 0x9f
			160, 161, 162, 184, 164, 165, 166, 167, 168, 169, 170,  171, 172,  173, 174, 175, //0xa0 - 0xaf
			176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186,  187, 188,  189, 190, 191, //0xb0 - 0xbf
			254, 224, 225, 246, 228, 229, 244, 227, 245, 232, 233,  234, 235,  236, 237, 238, //0xc0 - 0xcf
			239, 255, 240, 241, 242, 243, 230, 226, 252, 251, 231,  248, 253,  249, 247, 250, //0xd0 - 0xdf
			222, 192, 193, 214, 196, 197, 212, 195, 213, 200, 201,  202, 203,  204, 205, 206, //0xe0 - 0xef
			207, 223, 208, 209, 210, 211, 198, 194, 220, 219, 199,  216, 221,  217, 215, 218  //0xf0 - 0xff
		);
		for($i=0;$i<strlen($s);$i++) {
			$c=ord($s[$i]);
			if($c>=128)
				$s[$i]=chr($kw[$c-128]);
		}
		return $s;
	}
	
	/**
	 * Âסןמלמדאעוכüםאÿ פףםךצטÿ
	 */
	private static function _charset_utf8_win($s) {
		$r='';
		$state=1;
		for ($i=0;$i<strlen($s);$i++) {
			$c=ord($s[$i]);
			switch($state) {
				case 1: //not a special symbol
				if($c<=127) {
					$r.=$s[$i];
				} else {
					if(($c>>5)==6) {
						$c1=$c;
						$state=2;
					} else $r.=chr(128);
				}
				break;
				case 2: //an utf-8 encoded symbol has been meet
				$new_c2=($c1&3)*64+($c&63);
				$new_c1=($c1>>2)&5;
				$new_i=$new_c1*256+$new_c2;
				switch($new_i) {
					case   1025: $out_c='¨'; break;
					case   1105: $out_c='¸'; break;
					case 0x00ab: $out_c='«'; break;
					case 0x00bb: $out_c='»'; break;
					default: $out_c=chr($new_i-848);
				}
				$r.=$out_c;
				$state=1;
				break;
			}
		}
		return $r;
	}
	
	/**
	 * ------------------------------------------------------------------------------------------------
	 */


}
?>